# Following equations taken from Frey and Hinton, 
# Variational Learning in Nonlinear Gaussian Belief Networks,1998
#
# https://www.cs.toronto.edu/~hinton/absps/nlgbn.pdf
#

#---------------------------------------#
# Expectation of ∫ N(x|μ, σ) Φ(x) dx    #
#---------------------------------------#

M(μ, σ) = Φ(μ/sqrt(1+σ^2))


#---------------------------------------#
# Expectation of ∫ N(x|μ, σ) Φ(x*s) dx  #
#---------------------------------------#

M(μ, σ, s) = M(μ*s, σ*s)


#---------------------------------------------#
# Variance of ∫ N(x|μ, σ) (Φ(x) - M(μ,σ))² dx #
#---------------------------------------------#

V(μ, σ) = J(μ, σ) - M(μ,σ)^2


#---------------------------------------------#
# Expectation of ∫ N(x|μ, σ) [Φ(x)]² dx #
#---------------------------------------------#

B(μ, σ) = J(μ, σ)

#---------------------------------------#
# Expectation of ∫ N(x|μ, σ) M(x, s) dx #
#---------------------------------------#

function MM(μ, σ, s) 
   
    scale = sqrt(1+s^2)

    M(μ / scale, σ / scale)

end



# #---------------------------------------------------------------------#
# # Upper bound to variance of ∫ N(x| μ, σ) ⋅ (Φ(x) - M(μ, σ))² dx      #
# #---------------------------------------------------------------------#

# Vupper(μ, σ) = Φ(μ/sqrt(1+σ^2)) * (1-Φ(μ/sqrt(1+σ^2))) * (σ^2/(σ^2 + π/2))



# #------------------------------------------------------------------------------------#
# # Upper bound to expectation of square ∫ N(x|μ, σ) [Φ(x)]² dx = V(μ, σ) + [M(μ, σ)]² #
# #------------------------------------------------------------------------------------#

# Bslow(μ, σ) = V(μ, σ) + M(μ, σ)^2

# function B(μ, σ) 
    
#     Mμσ = M(μ, σ)

#     Mμσ * ( (1-Mμσ) * (σ^2/(σ^2 + π/2)) + Mμσ ) 

# end


# function B(μ, σ, s) 
    
#     scale = sqrt(1+s^2)

#     B(μ / scale, σ / scale)
# end


# #----------------------------------------------------------------------#
# # Convenience function that returns both M(μ, σ) and B(μ, σ) in one go #
# #----------------------------------------------------------------------#

# function MB(μ, σ) 
    
#     σ² = σ^2

#     Mμσ = Φ(μ/sqrt(1+σ²))

#     Bμσ = Mμσ * ( (1-Mμσ) * (σ²/(σ² + π/2)) + Mμσ ) 

#     Mμσ, Bμσ

# end


# #----------------------------------------------------------------------------#
# # Approximate, faster version of Φ and MB                                    #
# # Constant 1.7009913570613704 obtained from calculate_approximate_to_normcdf #
# #----------------------------------------------------------------------------#

# # sigm(x) = 1.0 / (1.0 + exp(-x))

# # Φapprox(x) = sigm(x * 1.7009913570613704) 

# Φapprox(x) = 1.0 / (1.0 + exp(-x*1.7009913570613704)) 

# function MBapprox(μ, σ) 
    
#     σ² = σ^2

#     Mμσ = Φapprox(μ/sqrt(1+σ²))

#     Bμσ = Mμσ * ( (1-Mμσ) * (σ²/(σ² + π/2)) + Mμσ ) 

#     Mμσ, Bμσ

# end